Revit 2026 API

# FindReferenceTarget Enumeration

---

The type of reference to find from a ReferenceIntersector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FindReferenceTarget
```
```vb
Public Enumeration FindReferenceTarget
```
```cpp
public enum class FindReferenceTarget
```
```fsharp
type FindReferenceTarget
```

| Member name | Value | Description |
| --- | --- | --- |
| All | 31 | All target types. |
| Curve | 8 | A curve. |
| Edge | 4 | An edge. |
| Element | 1 | An element. |
| Face | 16 | A face. |
| Mesh | 2 | A mesh. |

#### Reference

Autodesk.Revit.DB Namespace